Catalogs/isc_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>isc_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыХранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодХраненияВГХ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.isc_МетодХраненияВГХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство_ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствиеУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдУпаковки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/isc_Настройки/Ext/ManagerModule.bsl
Функция ПолучитьНастройки() Экспорт
    СткНастройки = Новый Структура("АдресУстройства,Логин,Пароль,Порт,Логирование");
	Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");
	Если Не ЗначениеЗаполнено(Настройки) Тогда
		Настройки = Справочники.isc_Настройки.СоздатьЭлемент();
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Length";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Height";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Width";
		стз = Настройки.МетодыХранения.Добавить();
		стз.ИмяСвойства = "Weight";
		Настройки.Записать();
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(СткНастройки, Настройки);
	СткНастройки.Вставить("МетодыХранения",Настройки.МетодыХранения.Выгрузить());
	СткНастройки.Вставить("СоответствиеУпаковок",Настройки.СоответствиеУпаковок.Выгрузить());
	Возврат СткНастройки;
КонецФункции


Процедура СохранитьНастройки(сткНастройки) Экспорт

	Настройки = Справочники.isc_Настройки.НайтиПоКоду("000000001");
	Если Не ЗНачениеЗаполнено(Настройки) Тогда
		Настройки = Справочники.isc_Настройки.СоздатьЭлемент();
		Настройки.Код = "000000001";
	Иначе
		Настройки = Настройки.ПолучитьОбъект();
	КонецЕсли;	
		ЗаполнитьЗначенияСвойств(Настройки, СткНастройки);
		Настройки.МетодыХранения.Загрузить(сткНастройки.МетодыХранения.Выгрузить());
		Настройки.СоответствиеУпаковок.Загрузить(сткНастройки.СоответствиеУпаковок.Выгрузить());
	    Настройки.Записать();
	Сообщить("Настройки сохранены!");
КонецПроцедуры

Функция УстановитьСоединениеНаСервере(ТестСоединения = Истина, ЧитатьИсторию = Ложь) Экспорт
	СткНастройки = ПолучитьНастройки();
	Если ЧитатьИсторию Тогда
		СтраницаСервера	  = "/history";
	Иначе         
		СтраницаСервера = "/data";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
	СткНастройки.АдресУстройства, //"89.175.58.20", // сервер (хост)
	СткНастройки.Порт, //60080, // порт, по умолчанию для http используется 80, для https 443
	СткНастройки.Логин,  //"user", // пользователь для доступа к серверу (если он есть)
	СткНастройки.Пароль, //"user", // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	Новый  ЗащищенноеСоединениеOpenSSL()// защищенное соединение, если используется https
	);
	Запрос = Новый HTTPЗапрос(СтраницаСервера);//"/data");
	Попытка
		Результат = Соединение.Получить(Запрос);
	Исключение
		Возврат Ложь;	
	КонецПопытки;	
	Возврат ?(ТестСоединения, Результат.КодСостояния = 200 ,Результат.ПолучитьТелоКакПоток());	
КонецФункции
